#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/devperimental/package-setup/runs/run-mvA4y8Z8af7DmXwq

Waiting for the plan to start...

Terraform v1.3.9
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_actions_secret.repo_secret["component-dataaccess"] will be created
  + resource "github_actions_secret" "repo_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "component-dataaccess"
      + secret_name     = "NUGET_PAT"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repo_secret["component-email"] will be created
  + resource "github_actions_secret" "repo_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "component-email"
      + secret_name     = "NUGET_PAT"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repo_secret["component-externalapis"] will be created
  + resource "github_actions_secret" "repo_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "component-externalapis"
      + secret_name     = "NUGET_PAT"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repo_secret["component-payments"] will be created
  + resource "github_actions_secret" "repo_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "component-payments"
      + secret_name     = "NUGET_PAT"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repo_secret["component-servicehelper"] will be created
  + resource "github_actions_secret" "repo_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "component-servicehelper"
      + secret_name     = "NUGET_PAT"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repo_secret["component-settings"] will be created
  + resource "github_actions_secret" "repo_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "component-settings"
      + secret_name     = "NUGET_PAT"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repo_secret["component-sms"] will be created
  + resource "github_actions_secret" "repo_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "component-sms"
      + secret_name     = "NUGET_PAT"
      + updated_at      = (known after apply)
    }

  # github_branch_protection.template-repo["component-dataaccess"] will be created
  + resource "github_branch_protection" "template-repo" {
      + allows_deletions                = true
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + required_approving_review_count = 0
          + restrict_dismissals             = true
        }
    }

  # github_branch_protection.template-repo["component-email"] will be created
  + resource "github_branch_protection" "template-repo" {
      + allows_deletions                = true
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + required_approving_review_count = 0
          + restrict_dismissals             = true
        }
    }

  # github_branch_protection.template-repo["component-externalapis"] will be created
  + resource "github_branch_protection" "template-repo" {
      + allows_deletions                = true
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + required_approving_review_count = 0
          + restrict_dismissals             = true
        }
    }

  # github_branch_protection.template-repo["component-payments"] will be created
  + resource "github_branch_protection" "template-repo" {
      + allows_deletions                = true
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + required_approving_review_count = 0
          + restrict_dismissals             = true
        }
    }

  # github_branch_protection.template-repo["component-servicehelper"] will be created
  + resource "github_branch_protection" "template-repo" {
      + allows_deletions                = true
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + required_approving_review_count = 0
          + restrict_dismissals             = true
        }
    }

  # github_branch_protection.template-repo["component-settings"] will be created
  + resource "github_branch_protection" "template-repo" {
      + allows_deletions                = true
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + required_approving_review_count = 0
          + restrict_dismissals             = true
        }
    }

  # github_branch_protection.template-repo["component-sms"] will be created
  + resource "github_branch_protection" "template-repo" {
      + allows_deletions                = true
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + required_approving_review_count = 0
          + restrict_dismissals             = true
        }
    }

  # github_repository.template-repo["component-dataaccess"] will be created
  + resource "github_repository" "template-repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + branches                    = (known after apply)
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Data Access component Repository"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "component-dataaccess"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = "public"

      + template {
          + owner      = "devperimental"
          + repository = "nuget-package-template"
        }
    }

  # github_repository.template-repo["component-email"] will be created
  + resource "github_repository" "template-repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + branches                    = (known after apply)
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Email Component Repository"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "component-email"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = "public"

      + template {
          + owner      = "devperimental"
          + repository = "nuget-package-template"
        }
    }

  # github_repository.template-repo["component-externalapis"] will be created
  + resource "github_repository" "template-repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + branches                    = (known after apply)
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "External Apis Component Repository"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "component-externalapis"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = "public"

      + template {
          + owner      = "devperimental"
          + repository = "nuget-package-template"
        }
    }

  # github_repository.template-repo["component-payments"] will be created
  + resource "github_repository" "template-repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + branches                    = (known after apply)
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Payments Component Repository"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "component-payments"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = "public"

      + template {
          + owner      = "devperimental"
          + repository = "nuget-package-template"
        }
    }

  # github_repository.template-repo["component-servicehelper"] will be created
  + resource "github_repository" "template-repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + branches                    = (known after apply)
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Service Helper Component Repository"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "component-servicehelper"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = "public"

      + template {
          + owner      = "devperimental"
          + repository = "nuget-package-template"
        }
    }

  # github_repository.template-repo["component-settings"] will be created
  + resource "github_repository" "template-repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + branches                    = (known after apply)
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Settings Component Repository"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "component-settings"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = "public"

      + template {
          + owner      = "devperimental"
          + repository = "nuget-package-template"
        }
    }

  # github_repository.template-repo["component-sms"] will be created
  + resource "github_repository" "template-repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + branches                    = (known after apply)
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Sms Component Repository"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "component-sms"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = "public"

      + template {
          + owner      = "devperimental"
          + repository = "nuget-package-template"
        }
    }

  # github_repository_collaborator.a_repo_collaborator["component-dataaccess"] will be created
  + resource "github_repository_collaborator" "a_repo_collaborator" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "admin"
      + permission_diff_suppression = false
      + repository                  = "component-dataaccess"
      + username                    = "chrisxpr"
    }

  # github_repository_collaborator.a_repo_collaborator["component-email"] will be created
  + resource "github_repository_collaborator" "a_repo_collaborator" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "admin"
      + permission_diff_suppression = false
      + repository                  = "component-email"
      + username                    = "chrisxpr"
    }

  # github_repository_collaborator.a_repo_collaborator["component-externalapis"] will be created
  + resource "github_repository_collaborator" "a_repo_collaborator" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "admin"
      + permission_diff_suppression = false
      + repository                  = "component-externalapis"
      + username                    = "chrisxpr"
    }

  # github_repository_collaborator.a_repo_collaborator["component-payments"] will be created
  + resource "github_repository_collaborator" "a_repo_collaborator" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "admin"
      + permission_diff_suppression = false
      + repository                  = "component-payments"
      + username                    = "chrisxpr"
    }

  # github_repository_collaborator.a_repo_collaborator["component-servicehelper"] will be created
  + resource "github_repository_collaborator" "a_repo_collaborator" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "admin"
      + permission_diff_suppression = false
      + repository                  = "component-servicehelper"
      + username                    = "chrisxpr"
    }

  # github_repository_collaborator.a_repo_collaborator["component-settings"] will be created
  + resource "github_repository_collaborator" "a_repo_collaborator" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "admin"
      + permission_diff_suppression = false
      + repository                  = "component-settings"
      + username                    = "chrisxpr"
    }

  # github_repository_collaborator.a_repo_collaborator["component-sms"] will be created
  + resource "github_repository_collaborator" "a_repo_collaborator" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "admin"
      + permission_diff_suppression = false
      + repository                  = "component-sms"
      + username                    = "chrisxpr"
    }

Plan: 28 to add, 0 to change, 0 to destroy.


```

</details>

*Pushed by: @chrisxpr, Action: `pull_request`*